<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>HTTPS</string>
                <key>ServerURL</key>
                <string>https://security.cloudflare-gateway.com/dns-query</string>
                <key>SupplementalMatchDomains</key>
                <array>
                    <!-- Essential Apple services required for normal device operation -->
                    <string>ocsp.apple.com</string>
                    <string>ocsp2.apple.com</string>
                    <string>mesu.apple.com</string>
                    <string>valid.apple.com</string>
                    <string>crl.apple.com</string>
                    <string>certs.apple.com</string>
                    <string>appattest.apple.com</string>
                    <string>vpp.itunes.apple.com</string>
                    <string>gdmf.apple.com</string>
                </array>
                <key>SupplementalBlockDomains</key>
                <array>
                    <!-- Blocking unwanted trackers and common ad networks -->
                    <string>ads.apple.com</string>
                    <string>tracking.apple.com</string>
                    <string>telemetry.apple.com</string>
                    <string>metrics.apple.com</string>
                    <string>doubleclick.net</string>
                    <string>google-analytics.com</string>
                </array>
            </dict>
            <key>OnDemandRules</key>
            <array>
                <dict>
                    <key>Action</key>
                    <string>Connect</string>
                </dict>
            </array>
            <key>PayloadDisplayName</key>
            <string>iOS Exploiters | DNS</string>
            <key>PayloadIdentifier</key>
            <string>IOS.EXPLOITERS.DNS.ID</string>
            <key>PayloadOrganization</key>
            <string>discord.gg/iosexploiters</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>5A1C45B6-0E7A-4F6E-A98A-FCB59D6A1D0E</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDescription</key>
    <string>DNS Protection: Blocks Third-Party Blacklists and Revocation Requests.</string>
    <key>PayloadDisplayName</key>
    <string>iOS Exploiters | DNS</string>
    <key>PayloadIdentifier</key>
    <string>IOS.EXPLOITERS.DNS.ID</string>
    <key>PayloadScope</key>
    <string>User</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>9C9F4EAF-BA92-4A3E-9182-BEF10B72A9DB</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
