<!-- Credits To Fake Scarlet For Helping Me Out With This DNS -->
<!-- It Took Me A While To Find The Services To Block, Im Not Very Expert With This Stuff -->

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <!-- General Payload Info -->
        <key>PayloadDescription</key>
        <string>DNS Protection: Blocks Third-Party Blacklists and Revocation Requests.</string>
        
        <key>PayloadDisplayName</key>
        <string>iOS Exploiters | DNS</string>
        
        <key>PayloadIdentifier</key>
        <string>IOS.EXPLOITERS.DNS.PROFILE.ID</string>
        
        <key>PayloadScope</key>
        <string>User</string>
        
        <key>PayloadType</key>
        <string>Configuration</string>
        
        <key>PayloadUUID</key>
        <string>IOS-EXPLOITERS-DNS-4F6E-A98A-FCB59D6A1D0E</string>
        
        <key>PayloadVersion</key>
        <integer>1</integer>
        
        <!-- Payload Content Array -->
        <key>PayloadContent</key>
        <array>
            <dict>
                <!-- Payload Metadata -->
                <key>PayloadDisplayName</key>
                <string>iOS Exploiters | DNS</string>
                
                <key>PayloadIdentifier</key>
                <string>IOS.EXPLOITERS.DNS.ID</string>
                
                <key>PayloadOrganization</key>
                <string>discord.gg/iosexploiters</string>
                
                <key>PayloadType</key>
                <string>com.apple.dnsSettings.managed</string>
                
                <key>PayloadUUID</key>
                <string>5A1C45B6-0E7A-4F6E-A98A-FCB59D6A1D0E</string>
                
                <key>PayloadVersion</key>
                <integer>1</integer>
                
                <!-- DNS Settings -->
                <key>DNSSettings</key>
                <dict>
                    <key>DNSProtocol</key>
                    <string>HTTPS</string>
                    
                    <!-- Cloudflare Gateway Server URL -->
                    <key>ServerURL</key>
                    <string>https://9mf3bwb2xa.cloudflare-gateway.com/dns-query</string>
                    
                    <!-- Apple Domain Exceptions (Allow) -->
                    <key>SupplementalMatchDomains</key>
                    <array>
                        <string>ocsp.apple.com</string>
                        <string>ocsp2.apple.com</string>
                        <string>mesu.apple.com</string>
                        <string>valid.apple.com</string>
                        <string>crl.apple.com</string>
                        <string>certs.apple.com</string>
                        <string>appattest.apple.com</string>
                        <string>vpp.itunes.apple.com</string>
                        <string>gdmf.apple.com</string>
                    </array>
                    
                    <!-- Blocked Domains -->
                    <key>SupplementalBlockDomains</key>
                    <array>
                        <!-- Certificate Validation & Revocation & Blacklisting -->
                        <string>ads.apple.com</string>
                        <string>tracking.apple.com</string>
                        <string>telemetry.apple.com</string>
                        <string>metrics.apple.com</string>
                        <string>crl.apple.com</string>
                        <string>ocsp.apple.com</string>
                        <string>ocsp2.apple.com</string>
                        <string>attestation.apple.com</string>
                        <string>feedbackws.apple.com</string>
                        <string>guzzoni.apple.com</string>
                        <string>attestation.itunes.apple.com</string>
                        <string>gspe1-ssl.ls.apple.com</string>
                        <string>gspe21-ssl.ls.apple.com</string>
                        
                        <!-- iCloud, Certificate & Device Management -->
                        <string>devicecheck.apple.com</string>
                        <string>albert.apple.com</string>
                        <string>configuration.apple.com</string>
                        <string>configuration.apple.com.akadns.net</string>
                        <string>cnfiguration.apple.com.edgekey.net</string>
                        <string>ip6-metrics.apple.com</string>
                        <string>internal.mzstatic.com</string>
                        <string>gs.apple.com</string>
                        <string>gsp10-ssl.ls.apple.com</string>
                        <string>init.itunes.apple.com</string>
                        <string>time-ios.apple.com</string>

                        <!-- iCloud Telemetry & Telemetry & Analytics Tracking -->
                        <string>p23-keyvalueservice.icloud.com</string>
                        <string>p23-ckdatabase.icloud.com</string>
                        <string>ckservice.icloud.com</string>
                        <string>doubleclick.net</string>
                        <string>google-analytics.com</string>
                        <string>ssl.google-analytics.com</string>
                        <string>stats.g.doubleclick.net</string>
                        <string>www.googletagmanager.com</string>
                        <string>analytics.edgekey.net</string>
                        <string>cloudservices.apple.com</string>
                        <string>iphonesubmissions.apple.com</string>
                    </array>
                </dict>
                
                <!-- On-Demand Rules -->
                <key>OnDemandRules</key>
                <array>
                    <dict>
                        <key>Action</key>
                        <string>Connect</string>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
